<details ><summary>Digger run report at 2026-02-07 04:52:54 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # render_static_site.site will be created
  + resource "render_static_site" "site" {
      + auto_deploy                   = true
      + branch                        = "main"
      + build_command                 = "echo 'Static site - no build needed'"
      + id                            = (known after apply)
      + name                          = "opentaco-demo"
      + notification_override         = (known after apply)
      + previews                      = (known after apply)
      + publish_path                  = "site"
      + pull_request_previews_enabled = (known after apply)
      + repo_url                      = "https://github.com/kvokka/opentaco-with-github-storage-example"
      + root_directory                = (known after apply)
      + slug                          = (known after apply)
      + url                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + site_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (render-static-site)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |         RESOURCE          |
|--------|---------------------------|
| add    | `render_static_site.site` |

| CHANGE |   OUTPUT   |
|--------|------------|
| add    | `site_url` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p render-static-site
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>